app/controllers/index_controller.rb

  def show
@results= RegWord.new.search(params[:search])
---
SELECT `reg_words`.* FROM `reg_words` WHERE (words Like'%what%')